weekdays = ('🌕 *Понедельник*',
            '🌖 *Вторник*',
            '🌗 *Среда*',
            '🌘 *Четверг*',
            '🌑 *Пятница*',
            '🌒 *Суббота*',
            '🌓 *Воскресенье*')

pair_time = [
            (28800, '1️⃣ 08:00'),
            (35100, '2️⃣ 09:45'),
            (41400, '3️⃣ 11:30'),
            (43200, '3️⃣ 12:00'),
            (49500, '4️⃣ 13:45'),
            (55800, '5️⃣ 15:30'),
            (62100, '6️⃣ 17:15'),
            (68400, '7️⃣ 19:00')]

important_links = '''
[Таймлайн](http://timeline.rsvpu.ru) - Информационная система 

[Электронная библиотека](http://umkd.rsvpu.ru) - Скачайте нужное вам методическое пособие

[Мои документы](http://www.rsvpu.ru/moi-dokumenty/) - Закажи любую справку в *одном* месте

[Об университете](http://www.rsvpu.ru/sveden/) - Сведения об образовательной организации
'''

primary_timetable = '''
`I   `1) 08:00 - 08:45
`         `2) 08:50 - 09:35

`II  `1) 09:45 - 10:30
`         `2) 10:35 - 11:20
`Перерыв 40 минут🍏` 
`III `1) 12:00 - 12:45
`         `2) 12:50 - 13:35

`IV  `1) 13:45 - 14:30
`         `2) 14:35 - 15:20

`V   `1) 15:30 - 16:15
`         `2) 16:20 - 17:05

`VI  `1) 17:15 - 18:00
`         `2) 18:05 - 18:50

`VII `1) 19:00 - 19:45
`         `2) 19:50 - 20:35
'''

senior_timetable = '''
`I   `1) 08:00 - 08:45
`         `2) 08:50 - 09:35

`II  `1) 09:45 - 10:30
`         `2) 10:35 - 11:20

`III `1) 11:30 - 12:15
`         `2) 12:20 - 13:05
`Перерыв 40 минут🍏`
`IV  `1) 13:45 - 14:30
`         `2) 14:35 - 15:20

`V   `1) 15:30 - 16:15
`         `2) 16:20 - 17:05

`VI  `1) 17:15 - 18:00
`         `2) 18:05 - 18:50

`VII `1) 19:00 - 19:45
`         `2) 19:50 - 20:35
'''

academic_buildings = (('Корпус 0',
                       'ул. Машиностроителей д. 11 \n Проезд: метро ст. «Уралмаш», троллейбус 8, 10, 17, трамвай 5, 24, автобус 56, 33, 36 остановка «Площадь 1-ой Пятилетки».'),
                      ('Корпус 1',
                       'ул. Машиностроителей д. 2, Проезд: метро ст. «Уралмаш», троллейбус 8, 10, 17, трамвай 5, 24, автобус 56, 33, 36 остановка «Площадь 1-ой Пятилетки».'),
                      ('Корпус 2',
                       'ул. Машиностроителей д. 11 \n Проезд: метро ст. «Уралмаш», троллейбус 8, 10, 17, трамвай 5, 24, автобус 56, 33, 36 остановка «Площадь 1-ой Пятилетки».'),
                      ('Корпус 3', 'ул. Каширская, 73 \n Проезд: троллейбус 13, 16, остановка «Таганская»'),
                      ('Корпус 4', 'ул. Каширская, 73 \n Проезд: троллейбус 13, 16, остановка «Таганская»'),
                      ('Корпус 5', 'ул. Каширская, 73 \n Проезд: троллейбус 13, 16, остановка «Таганская»'),
                      ('Корпус 6', 'ул. Каширская, 73 \n Проезд: троллейбус 13, 16, остановка «Таганская»'),
                      ('Корпус 7',
                       'ул. Машиностроителей д. 11 \n Проезд: метро ст. «Уралмаш», троллейбус 8, 10, 17, трамвай 5, 24, автобус 56, 33, 36 остановка «Площадь 1-ой Пятилетки».'),
                      ('Корпус 8',
                       'ул. Машиностроителей д. 11 \n Проезд: метро ст. «Уралмаш», троллейбус 8, 10, 17, трамвай 5, 24, автобус 56, 33, 36 остановка «Площадь 1-ой Пятилетки».'),
                      ('Корпус 9', 'ул. Ильича, 26 \n Проезд: троллейбус 10, остановка «Библиотека»'),
                      ('Корпус 10',
                       'ул. Луначарского, 85а \nПроезд: трамвай 2, 3, 8, 14, 20, 25, 26, остановка «Шевченко»'),
                      ('Корпус 11',
                       'ул. Машиностроителей, 9 \n Проезд: метро ст. «Уралмаш», троллейбус 8, 10, 17, трамвай 5, 24, автобус 56, 33, 36 остановка «Площадь 1-ой Пятилетки».'),
                      ('Корпус 12',
                       'ул. Машиностроителей, 9 \n Проезд: метро ст. «Уралмаш», троллейбус 8, 10, 17, трамвай 5, 24, автобус 56, 33, 36 остановка «Площадь 1-ой Пятилетки».'),
                      ('Корпус 13',
                       'ул. Таганская, 75, 75а (Колледж электроэнергетики и машиностроения) \nПроезд: троллейбус 13, 16, остановка «Таганская»'),
                      ('Корпус 14',
                       'ул. Таганская, 75, 75а (Колледж электроэнергетики и машиностроения) \nПроезд: троллейбус 13, 16, остановка «Таганская»'),
                      ('Корпус 15', 'ул. Фрезеровщиков, 78а'),
                      ('Корпус 16',
                       'ул. Баумана, дом 28 а, г. Екатеринбург (здание бывшего научно-учебного центра)\nПроезд: метро ст. «Уралмаш», автобус 36, 149, 148 остановка «ДК УЭТМ». Троллейбус 16,  автобус 148 остановка «Шефская».'),
                      ('Корпус 17', 'ул. Энгельса, дом 12 а, г. Первоуральске (здание дома культуры «Горняк»)'))

TIMETABLE = 'Расписание звонков ⏰'
IMPORTANT_LINS = 'Важные ссылки 📌'
LOCATION_OF_BUILDINGS = 'Расположение корпусов 🏛'
SETTINGS = 'Настройки 🛠'
DATE = 'Дата 📅'
WEEK = 'Неделя 🗓'
TWO_WEEK = 'Две недели 🗒'
TODAY = 'Сегодня 📅️'
TOMORROW = 'Завтра 📆'
MENU = 'В меню 🏠'
SENIOR_TIMETABLE = '3, 4 и 5 курсы'
PRIMARY_TIMETABLE = '1 и 2 курс'
ON_NEWS = 'Отключить новости❎️'
OFF_NEWS = 'Включить новости✅'
TIMELINE = 'Таймлайн 📎'
SCHEDULE_SUB = 'Подписка на расписание 📭'
SUB_ERROR = 'Оформите подписку что бы получать расписание'
SCHEDULE_TEACHER = 'Преподаватель 👤'
SCHEDULE_GROUP = 'Группа 👥'
SCHEDULE_CLASSROOM = 'Аудитория 🔢'
CANCEL = 'Отмена ❌'
MENU_ENTER = 'Открываю меню'
SELECT_INTERVAL = 'Выберите нобходимый промежуток.'
SPLIT_WEEKS = '🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸🔸'
NONE_TEXT_MSG = 'Мой создатель не обучил меня для работы с файлами, кидайте в него тапочки)))'